{
  "irVersion": "1.0",
  "project": "gorod",
  "repository": "https://github.com/grokify/gorod",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-03-14",
      "highlights": [
        { "description": "CLI tool for headless browser operations with `gorod fetch` command" },
        { "description": "Cookie extraction with conversion to standard `http.Cookie` format" },
        { "description": "Wait helper functions for reliable element interaction" }
      ],
      "added": [
        { "description": "`cmd/gorod` CLI tool with `fetch` command for headless page rendering", "commit": "e5685d9" },
        { "description": "`Cookies` type wrapping Rod cookies with `HTTPCookies()` and `String()` methods", "commit": "8bef8fd" },
        { "description": "`ForegroundBrowser.Cookies()` method to extract browser cookies", "commit": "5cb78a2" },
        { "description": "`WaitVisible()` function to wait for element visibility with timeout", "commit": "c0bb044" },
        { "description": "`WaitClickable()` function to wait for element to be visible and enabled", "commit": "c0bb044" },
        { "description": "`ErrBrowserNotInitialized` error for nil browser handling", "commit": "5cb78a2" }
      ],
      "changed": [
        { "description": "Use `bufio.Reader` for input handling in `ForegroundBrowser` (fixes empty line issues)", "commit": "5cb78a2" },
        { "description": "Add `MustWaitStable()` after page navigation for better reliability", "commit": "5cb78a2" }
      ],
      "documentation": [
        { "description": "Expanded README with quick start guide, API reference, and usage examples", "commit": "176e381" },
        { "description": "Add `examples/cookies/` demonstrating cookie extraction", "commit": "f52c544" }
      ],
      "dependencies": [
        { "description": "Update `github.com/grokify/mogo` to v0.73.5", "commit": "176e381" },
        { "description": "Add `github.com/spf13/cobra` for CLI framework", "commit": "176e381" },
        { "description": "Add `github.com/jessevdk/go-flags` for example CLI parsing", "commit": "176e381" },
        { "description": "Add `fetchup` replace directive for rod v0.116.2 compatibility", "commit": "176e381" }
      ]
    },
    {
      "version": "v0.1.5",
      "date": "2025-11-29",
      "dependencies": [
        { "description": "Update `github.com/grokify/mogo` to v0.71.10", "commit": "7b0a20f" },
        { "description": "Update GitHub Actions (checkout v6, setup-go v6, golangci-lint-action v9)", "commit": "45ea34e" }
      ],
      "build": [
        { "description": "Update Go versions in CI workflow", "commit": "08f12f9" }
      ]
    },
    {
      "version": "v0.1.4",
      "date": "2025-06-07",
      "dependencies": [
        { "description": "Update `github.com/grokify/mogo` to v0.70.8", "commit": "377fefc" }
      ]
    },
    {
      "version": "v0.1.3",
      "date": "2024-11-10",
      "dependencies": [
        { "description": "Update `github.com/grokify/mogo` to v0.68.1", "commit": "960f853" }
      ],
      "build": [
        { "description": "Update golangci-lint to v2 with action v8", "commit": "0946f7a" }
      ]
    },
    {
      "version": "v0.1.2",
      "date": "2024-08-17",
      "dependencies": [
        { "description": "Update `github.com/go-rod/rod` to v0.116.2", "commit": "f68a394" },
        { "description": "Update `github.com/grokify/mogo` to v0.64.5", "commit": "53aa37d" }
      ],
      "fixed": [
        { "description": "Fix integer overflow conversion `uint -> int64` (gosec G115)", "commit": "0fb2082" },
        { "description": "Fix misspelling in lint configuration", "commit": "4f19614" }
      ]
    },
    {
      "version": "v0.1.1",
      "date": "2024-03-25",
      "dependencies": [
        { "description": "Update `github.com/go-rod/rod` to v0.115.0", "commit": "b6f293f" },
        { "description": "Update `github.com/grokify/mogo` to v0.63.8", "commit": "fc8269e" }
      ],
      "build": [
        { "description": "Update golangci-lint-action from 4 to 6", "commit": "7b789af" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2023-10-22",
      "highlights": [
        { "description": "Initial release with ForegroundBrowser for interactive browser sessions and full-page screenshot capture" }
      ],
      "added": [
        { "description": "`ForegroundBrowser` type for interactive browser sessions with pause capability", "commit": "cec2f95" },
        { "description": "`NewForegroundBrowserPaused()` to launch browser and wait for user interaction", "commit": "cec2f95" },
        { "description": "`RetrieveWriteScreenshotFullPage()` for full-page screenshots with HTTP status handling", "commit": "cec2f95" },
        { "description": "`GetWriteFileHTML()` to fetch and save page HTML to file", "commit": "cec2f95" }
      ],
      "build": [
        { "description": "GitHub Actions CI workflow for testing", "commit": "92c1422" },
        { "description": "golangci-lint configuration", "commit": "d737cf0" },
        { "description": "Dependabot configuration for automated dependency updates", "commit": "1e8bfcf" }
      ]
    }
  ]
}
